AbraxasVi/WT32-ETH01_ntp_server/sdkconfig.defaults
# =====================================================================
# WT32-ETH01 GPS/PPS NTP Server — 工程默认配置
# 说明：sdkconfig 已存在时本文件不会覆盖其中已有项；
#       若修改本文件后想让默认值生效，请删除 sdkconfig 后重新
#       idf.py set-target esp32 && idf.py build
# =====================================================================

CONFIG_IDF_TARGET="esp32"

# ---------------- 以太网：ESP32 内置 EMAC + 板载 LAN8720 ----------------
CONFIG_ETH_USE_ESP32_EMAC=y

# ---------------- 主频：240MHz，降低中断响应抖动 ------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ---------------- lwIP：并发与缓冲 -------------------------------------
# 开启 core locking 后，NTP 任务可以直接在自身上下文调用 lwIP，
# 不必切到 tcpip 线程，发送时戳更贴近实际上线路时刻
CONFIG_LWIP_TCPIP_CORE_LOCKING=y
CONFIG_LWIP_TCPIP_CORE_LOCKING_INPUT=y
# UDP 接收队列深度：这是 lwIP 里 UDP 真正的"缓冲"，
# 默认 6 太浅，突发 NTP 查询会直接丢包
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
# 允许 setsockopt(SO_RCVBUF)
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_MAX_SOCKETS=12
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
# lwIP tcpip 线程固定到 CPU1（网络核），
# 让 CPU0 专心跑 PPS 中断 / 时基伺服 / GPS 串口，减少中断响应抖动
# 只设 choice 项即可：CONFIG_LWIP_TCPIP_TASK_AFFINITY 由它推导，无需重复写
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y

# ---------------- 看门狗 ------------------------------------------------
# 超时值与 panic 行为由 app_main() 里的 esp_task_wdt_init() 决定
# （见 main/config.h 的 CFG_WDT_TIMEOUT_MS），这里关掉启动阶段自动初始化。
# 说明：ESP_TASK_WDT_PANIC / TIMEOUT_S 等选项 depends on ESP_TASK_WDT_INIT，
# 关掉后它们在 menuconfig 中不可见，也就不可能出现第二处"事实来源"。
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_INT_WDT=y

# ---------------- 日志 --------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
